[Oreans]

&New = 新建
&Open... = 打开
&Save = 保存
Save &As... = 保存为...
&Protect = 保护
&Help = 帮助
About... = 关于...
Demo Version = 演示版
Save = 保存

Options = 选项
Application Information = 应用程序信息
Protection Options = 保护选项
Protection Macros = 保护宏
Code Replace = 替换代码
Virtual Machine = 虚拟机
Customized Dialogs = 定制提示消息框
Advanced Options = 高级选项
XBundler = XBundler
Help = 帮助
Registration = 使用授权-许可证
Trial Settings = 使用授权-试用
Hardware Lock = 使用授权-硬件锁
Password Protection = 使用授权-密码保护
Soft&ware = 软件
&Customers = 客户
&License Manager = 许可证管理
&Managers = 管理
&Project = 项目
Tools = 工具
H&elp = 帮助
&Contents = 内容
&About = 关于
Export Generators = 专家式生成
&Software = 软件
&License = 许可证
Password = 密码
Trial Extension = 试用延期
&Exit = 退出
P&rotect = 保护
Open Project = 打开工程
New Project = 新建工程
Save Project = 保存工程
Save Project As... = 工程另存为
Protect File = 保护文件
Dupli&cate = 相同
(Double click to select) = (双击选择）


Application = 应用程序
Version = 版本
Input Filename = 输入文件名
Output Filename = 输出文件名
File Size = 文件大小
File Information = 文件信息
Get from version info = 从版本信息中取得
File not found = 没有找到文件
Refresh = 刷新
Same as input = 和输入相同

Advanced Anti-Debugger = 高级反调试器
Enable Protection = 开启保护
Advanced API-Wrapping = 高级 API-封装
Anti Dumpers = 反内存抓取
Entry Point Obfuscation = 混淆应用程序入口点
Anti-Patching = 阻止修补
None = 没有
File Patching = 文件补丁
Compression = 压缩
Resources = 资源监控
Monitor Blockers = 监视器阻止
Files Monitors = 文件监视器
Registry Monitors = 注册表监视器
Delphi/BCB Form Protection = delphi/BCB 窗体保护
Memory Guard = 内存保护
Resources Encryption = 资源加密
VMWare/Virtual PC = VMWvare/虚拟 PC
Compatible = 兼容
When Debugger Found = 如果检查到调试器
Enable Encryption = 开启加密
Display Message = 显示消息
Exit Silently = 静默推出
Crash Application = 破坏应用程序
Metamorph Security = 结构变量安全
Ring-0 Protection = Ring-0 级别保护
(not available in DEMO) = 在试用版不可用

Import = 导入
Export = 导出
Reset Messages = 重置消息

Global Caption = 全局标题
Debugger found = 发现调试器
Monitor software found = 发现监控软件
Cracking tool found = 发现破解工具
File corrupted = 文件毁坏
(Not displayed in this version) = 在这个版本不显示
Internal exception occured =  发现内部的一个异常
Virtual Machine Detected = 发现虚拟机


Enable CodeReplace Technology = 启用代码替换功能
Functions to remove using the CodeReplace Technology: = 此功能用以移除代码替换技术时使用
Assembly code inside function: = 嵌入汇编代码
Force simulation before protection = 在保护前强制模拟
Run with parameters = 带参数运行
Start Simulation = 开始模拟

Virtual API-Wrapper = 虚拟机API封装器
Imported DLLs: = 导入动态连接库
Functions to Virtualize: = 需要虚拟化API函数
API Virtualization Level: = API虚拟化等级
Processor Specifications = 处理器规格
Processor Type: = 处理器类型
Multiprocessor: = 多处理器
Opcode Type: = 操作码类型
Dynamic Opcode: = 动态操作码
VM Complexity: = 虚拟机复杂化
VM size (aprox): = 虚拟机大小
Execution Speed: = 执行速度
Entry Point Virtualization = 虚拟化入口
Multi Branch Technology = 多分支技术

Mutable CISC processor = 定长的CISC处理器
Mutable RISC-64 processor = 定长的RISC-64 位处理器
Mutable RISC-128 processor = 定长的RISC-128 位处理器
Mutable CISC-2 processor = 定长的CISC-2处理器

Static opcodes = 静态的操作码
Metamorphic - Level 1 = 变化等级1
Metamorphic - Level 2 = 变化等级2
Metamorphic - Level 3 = 变化等级3

Disabled = 不允许
20% Dynamic = 20%动态
40% Dynamic = 40%动态
60% Dynamic = 60%动态
80% Dynamic = 80%动态

Enable XBundler = 启用 XBundler 
Make files visible to OpenDialog = 使文件在打开对话框中可见
Allow bundling from any directory = 允许从任何目录绑定
AVI files support = 支持AVI文件
Deleted extracted on exit = 当退出时删除
Files to bundle: (drag files here) = 需要绑定的文件（拖拉文件到这里）
XBundler Options = XBundler 选项
Add File = 加文件
Delete File = 删除文件

Filename = 文件名
Write to disk? = 写到磁盘中去
Extraction Path (if written to disk) = 解压到路径（如果写到磁盘中去）


Encrypt Application = 加密应用程序
Protect as DLL Plugin = 保护插件类型的 DLL，
Protect DLL plugin = 保护插件类 DLL
Last Section Name = 最后段的名称
.NET assemblies = .net 组件
Active Context = 激活上下文帮助
Enable support = 启用支持
Splash screen settings = 动态的画面设置
Mouse Click to proceed = 鼠标点击继续运行
Display during a number of seconds = 显示时间为以下指定的秒数

This option will encrypt your protected application. You should never uncheck this option, only for debug purposes. = 此选项将要加密你的应用程序。除非调试的需要，你应该一直勾选此项

Check this option only if your protected DLL will be used as plugin in third party software. = 只有你的软件作为第三方插件，才需要选择此保护项。

You can change the name of the last section added by Themida = 你可以改变由Themida加入的最后一个段的名字

This option should always be enabled to protect your .NET assemblies = 这个选项应该一直开启来保护你的 .NET组件

Support for Active Context based DLLs =  支持以Active Context为基础的动态链接库

Select a BMP-8 image that will be displayed when your application is launched = 选择一个8位色的BMP图片，当程序启动时显示它。

The user must click in the Splash Screen to continue running the protected application = 用户必须点击启动画面才能继续运行保护的程序

The splash screen will be displayed for a custom number of seconds before continue running the protected application = 启动画面将在保护的应用程序运行的时候，在设定的时间显示

This option will enable Trial and Licensing protections in Ring-0, which will enhance the way that trial information is stored in the system. If you check this option, a device driver will be embedded and extracted automatically when your application runs. Notice that the Hardware ID is different if you enable or disable this option. = 这个选项在Ring-0级开启试用版和序列号保护。 试用的信息将存储到系统中。当你检查这一项时，一个设备驱动将会自动的解开这些信息。主要硬件的标识码在这个选项开启和关闭将不一样的。


Reading SDK Macros = 正在读取SDK的宏
Redirecting and Encrypting SDK Macros = 正在重新定位和加密SDK宏
Merging sections / Preparing PE Header = 正在合并段/准备 PE文件头
Examining and Wrapping API Calls = 正在检查和包装API 调用
Generating Unique SecureEngine Code = 正在生成唯一的安全引擎代码
Linking SecureEngine Code with Application =正在链接安全引擎到应用程序中
Generating Unique Virtual Machine = 正在生成特定的虚拟机
Compressing Virtual Machine = 正在压缩虚拟机
Virtualizing VM / CodeReplace Macros = 虚拟化虚拟机/代码替换宏
Compressing Application and Resources = 压缩应用程序和资源
Encrypting Application and Resources = 加密应用程序和资源

Test Protected File = 测试保护的文件
Protect = 保护
Cancel = 取消
Play sound when protection finishes = 请在保护结束时发出声音

This option supervises at any time if your application is running under any kind of debugger. = 当你的程序被任何方式调试执行时，这个选项会在任何运行
This option avoids your application from being dumped from memory to disk even using the most advanced memory dumping tools = 这个选项避免输出内存信息到磁盘上去，即使是很高级的内存信息抓取工具。
This option removes and encrypts the entry point of your application, executing it from a secure place in memory = 这个选项转移和加密你的程序入口点。在一个很安全的入口地方执行你的程序。
This option will keep your application resources fully encrypted against modifications = 这个选项将保存你的应用程序资源被加密而且不可以修改
If you want that your application will run inside VMWare/VirtualPC you must check this option = 你必须勾选这一项如果你想让你的程序可以在VMWare/VirtualPC上运行。
This option will wrap the APIs used in your application to avoid a possible reconstruction of your original application = 这个选项将封装你的程序的APIs来避免你原来的程序被破解。
This option detects if any modification is done to your protected application, either by a cracker or a virus = 这个选项来检查你的应用程序有没有被病毒或者其它破解者修改
This option will activate the internal Metamorph engine to generate multiples opcode mutations for a single block of code = 这个选项将位单块的程序激活内部的测定引擎来生成多字节码的转换
This option will protect your application against memory patching = 这个选项将保护你的程序不被内存补丁修补
This option allows you to choose the desired option to perform when a debugger or cracking tool has been found in memory = 这个选项可以让你在发现调试工具或者破解工具时做出你想要的选择
This option keeps your application code compressed meanwhile it is not executed = 这个选项保持你的程序在没有运行时时压缩状态。
This option keeps the resources in your application fully compressed = 这个选项保存你的应用程序资源被完全的压缩
This option will compress the SecureEngine code that is appended into your protected application = 这个选项将在你的保护程序中加入SecureEngine压缩代码。
This option will detect/fool possible files monitors when your protected application is running = 这个选项将会在你的程序运行时决定和欺骗可能的监控程序。
This option will detect/fool possible registry monitors when your protected application is running = 这个选项将会在你的程序运行时发现和欺骗，可能的注册表监控程序及其文件监控程序。
This option will protect your Delphi/BCB forms against reconstruction from memory. Note that this option is incompatible with some Delphi/BCB applications = 这个选项保护你的Delphi/BCB窗体在内存中不被反解码。请注意，这个选项可能与一些Delphi/BCB程序不兼容
Load your customized messages from a file = 从文件中导入定制化的消息
Save your customized messages to a file = 保存定制化的消息到一个文件
This list displays all the DLLs imported by your application = 这个列表显示了你应用程序所使用到的DLLs
This list displays all the imported functions for the selected DLL. You can select which functions will be "virtualized" = 这个列表显示了你所有DLL。你可以选择虚拟化哪个函数。
You can import API names from a text file. The imported APIs will be virtualized in the current project = 你可以从一个文本中导入API名字。重要的API将会被虚拟化。
Select the maximun number of instructions to virtualize from your application entry point = 选择在你的应用程序入口中虚拟化时最大的指令数目。
This option will insert multiple conditional branch instructions inside your unique Virtual Machine, making it harder to analyze = 这个选项将在的的唯一的虚拟机中插入多字节的多条件指令。使它很难分析。
You can save the current selected APIs into a text file to be imported by another project = 你可以保存当前选中的APIs到一个文本文件，然后导入到其它项目
Complexity level to emulate each wrapped API = 模拟每个封装API 的复杂度
Changes have been made. Do you want to save project? = 项目被改变了，你想保存项目么？
Save Changes = 保存改变
*UNSAVED* = *没有保存*
Invalid Project File. Please, recreate a new one = 无效的工程文件。请重新创建一个新的
Load Project = 导入项目
You need XBundler .NET for your .NET application. Please contact info@oreans.com = 你需要XBundler .NET版本来保护你的.NET文件，请联系info@oreans.com
Sorry, Themida Standard cannot protect .NET files. You need to upgrade to Themida Professional for .NET support. Upgrade now? = 对不起，Themida 标准版本不支持.NET文件，你需要升级到Themida 专业版本来支持.NET
Save Project = 保存项目
Save Project As... = 项目另存为...
No file selected. Please select a file to protect (Input Filename) =  没有选中文件，请选中要保护的文件（输入文件名）
No Output file selected. Please select an Output file before protecting = 没有选中输出文件，请在做保护请选中输出文件
File does not exists: = 文件不存在：
File is already protected/compressed: = 文件已经被保存
File has invalid macros insertion: = 文件存在无效的宏
Please, review your macros again = 请重新检查你的宏
File cannot be accessed for protection: = 不能访问文件在做保护
Please select a new file to protect (Input Filename) = 请选中要保护的文件（输入文件名）
File has not being simulated. Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = 文件没有被模拟化，请在保护前模拟化文件或者勾选“强制在保护前模拟化”勾选框。
Open Input File = 打开输入文件
The resources section in your application is empty. Themida needs to rebuild your application header. Proceed? = 你程序中的资源段时空的。Themida 需要重新编译你的应用程序头部分，继续？
Rebuild Header = 重新编译头部分
File is compressed or already protected: = 文件被压缩或者已经被保护：
Your application seems to be in use or running in memory. Please, make sure to close it before proceeding = 你的程序好像已经在内存中运行了，平确认在做保护前关闭它
Error = 错误
Your application header is incompatible with Themida. Do you want Themida to rebuild your application header? = 你的应用程序头部分与Themida不兼容，你想Themida重新编译你的应用程序头部分？
.NET limitation = .NET限制
Sorry, you cannot change the global message caption in demo version = 对不起，你不能在演示版本中改变全局的消息。
Warning! The current CodeReplace macros are not valid for the selected file. CodeReplace macros removed = 警告：代码替换宏对于当前选中的文件无效。代码替换宏被退出。
Warning = 警告
Warning! The current application is already protected/compressed. Do you still want to protect it? = 当前的应用程序已经被压缩或者被保护，你想继续保护么？
File has a missing macro START or END: = 文件缺少START 宏或者END 宏
Please review your macros again = 请重新检查你的宏
File cannot be opened: = 不能打开文件
Make sure that other application is not using it = 请确认其它的应用程序没有在使用它
File to protect has an invalid PE header. Unable to inspect file = 想保护的文件PE 头无效，不能保护这个文件
File to protect contains one macro with few lines of code on it. Please review your macros again = 要保护的文件中存在一个宏包含太少的代码。请重新检查你的宏。
Sorry, the current version of Themida does not support CodeReplace in Visual Basic Pcode applications = 对不起，当前版本的Themida不支持代码替换功能在Visual Basic应用程序中使用
Sorry, the current version of Themida does not support CodeReplace in .NET applications = 对不起，当前版本的Themida不支持代码替换功能在.NET应用程序中使用
Unable to find a function to add CodeReplace technology = 找不到方法来添加代码替换技术
Run with parameters = 带参数运行
Please enter the parameters = 请输入参数
Sorry, you cant disable that option in demo version = 对不起，你不能在演示版本上关闭这个设置
Messages exported to = 消息导出到
Messages imported from = 消息导入到
Themida GUI Overview = Themida界面概括
Protect Now = 现在保护
SecureEngine Technology = SecureEngine技术
SecureEngine Macros = SecureEngine宏
Code Replace = 代码替换
Software Updates = 软件更新
What is XBundler = 什么是XBundler 
Using XBundler = 使用XBundler 

Scenarios for Using XBundler = 使用XBundler 的情况
*** ERROR: Project file does not exist or invalid. (Exit code 1) *** = ***错误：项目文件不存在或者无效***（退出码 1）
*** ERROR: File to protect does not exist. (Exit code 2) *** = ***错误：要保护的文件不存在***（退出码 2）
*** ERROR: File is already protected. (Exit code 3) *** = ***错误：文件已经被保护了***（退出码 3）
*** ERROR: Error in SecureEngine macros. Please review them again. (Exit code 4) *** = ***错误：SecureEngine 宏，请检查这些宏***（退出码 3）
*** ERROR: File to protect cannot be opened. (Exit code 2) *** = ***错误：要保护的文件打不开***（退出码 2）
*** ERROR: The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = ***错误：启动画面的文件不是256色，只有256色的图片文件才能正确的显示***
*** ERROR: The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = ***错误：启动画面的文件好像被压缩了，只有没有压缩图片文件才能正确的显示***
Macros found: = 发现宏
*** Fatal error while protecting file. (Exit Code 5) *** = ***保护文件是发生重大错误（退出码 5）
*** ERROR: Cannot write protected file. Make sure the file is not in use. (Exit code 6) *** = ***错误（退出码 6）
Generating Unique SecureEngine Code... = ***错误：
Linking SecureEngine Code with Application... = 连接SecureEngine 代码到程序
done. = 完成
Encrypting Application and Resources... = 加密应用程序和资源...
Compressing Application and Resources... = 压缩应用程序和资源...
Macros processed: = 处理了宏

processed: 处理完成
Application successfully protected. = 成功地保护了应用程序
Do you want to go to the order form Themida subscription plans? = 你想转到Themida 的计划表单码？
No file selected. Please, select a file to protect (Input Filename) = 没有选中文件，请选中要保护的文件（输入文件名）
Question = 问题
-- Files to Bundle -- = --打包的文件--
The path of the file that you are inserting must be relative to: = 你输入的文件路径必须相关：
All imported by ordinal! = 所以的都被导入成功
Medium = 中等的
Normal = 中等的
High = 高的
Supreme = 极高的
Extreme = 极端的高的
Highest = 最高的

This option is not enabled in DEMO version = 这个选项在试用版本不可用
DEMO Restriction = 试用版本注册
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = 启动画面的文件不是256色，只有256色的图片文件才能正确的显示
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = 启动画面的文件好像被压缩了，只有没有压缩图片文件才能正确的显示
Sorry, Themida DEMO does not support RISC-128 processors = 对不起，Themida 演示版本不支持RISC-128处理器
Processor Type = 处理器类型
Sorry, Themida DEMO does not support Dynamic Opcodes = 对不起，Themida 演示版本不支持动态操作码
The file is never extracted to disk! = 这个文件从来没有被导出到硬盘中
Select file/s to bundle = 选择打包的文件
No file selected. Please, select a file to protect (Input Filename) = 没有选中文件，请选中要保护的文件（输入文件名）
Last Modified: = 最后修改者：
(Application header has been rebuilt by Themida) = 文件类型：应用程序头被Themida重新编译
File Type: Windows Standard Executable = 文件类型：Windows 标准应用程序
File Type: Visual Basic Native Executable = 文件类型：Visual Basic 本地应用程序
File Type: Visual Basic PCode Executable = 文件类型：Visual Basic 机器码应用程序
File Type: Windows .NET Executable = 文件类型：Windows .NET应用程序
File Type: MACROMEDIA Executable = 文件类型：MACROMEDIA应用程序
File Type: PowerBuilder Application = 文件类型：PowerBuilder应用程序
File Type: Excelsior JET Application = 文件类型：Excelsior JET应用程序
File Type: Dynamic Link Library (DLL) = 文件类型：动态链接库(DLL)
File Type: OLE Control Extension (OCX) File = 文件类型：OLE控件扩展文件(OCX)
File Type: Screensaver File = 屏幕文件类型：
File Type: Windows NT Service = Windows NT服务文件类型：
File Type: Borland Library = 文件类型：Borland 库
File Type: Linux Executable (ELF/i386) = 文件类型：Linux应用程序(ELF/i386)
File Type: NT Device Driver = 文件类型：NT设备驱动文件

*** Protected with Code Virtualizer *** = ***使用虚拟化器进行保护***
Virtual Machine Macro Functions: = 虚拟机宏方法
CodeReplace Macro Functions: = 代码替换宏方法
CodeEncrypt Macro Functions: = 代码加密宏方法
ClearCode Macro Functions: = 清除代码宏方法
Registered Macro Functions: = 注册宏方法
Unregistered Macro Functions: = 取消注册宏方法
Read functions automatically = 自动获取函数
Read functions from SDK = 从SDK中读取函数
File already protected/compressed. = 文件已经被保护或者压缩
Error: There is a missing START or END in one of your macros. = 错误：文件中的一个宏中缺少START 或者END
Error: Unable to open the selected file. File may be in use. = 错误：不能打开所选择的文件，可能这个文件正在被使用中
Error: Invalid PE header in selected file. = 错误：所选择的文件无效的PE（应用程序)头段
Error: The included code inside a macro is too small. = 错误：当前的宏中的所包含代码太少
Error: There are at least a nested VM macros. VM macros cannot be nested. = 错误：至少包括一个本地的虚拟机宏，虚拟机宏不能被本地化的
Error: The selected file is not an x64 application. You need Themida x32 to protect that application. =错误：选择的文件不是64位应用程序。你需要用Themida 32位来保护你的应用程序。 
Error: The selected file is an x64 application. You need Themida x64 Edition to protect that application. = 错误：选择的文件是64位应用程序。你需要用Themida 64位版本来保护你的应用程序。 
Project: = 项目
Select functions from MAP file = 从映射文件中选择方法
Read functions automatically = 自动读取方法
How many functions do you want to add? = 你想加入多少的方法
OK = 确认
Sorry, the required MAP file was not found. Please, generate a MAP file for your application = 没有找到映射文件请为你的应用程序生成映射文件
There are not functions to simulate. Please, insert some functions either manually or automatically = 在模拟器中没有找到方法，请手动或者自动的插入方法
Simulator = 模拟器
Information = 信息
None = 没有
Message = 消息
Customize Dialog = 定制化对话框
Close = 关闭

Internal Protection Messages = 内部的保护消息
Trial/Registration Messages = 试用/注册消息
Will be displayed by WinLicense = 将会被WinLicense来显示
Displayed by SDK or not displayed = 将会被SDK来显示或者不显示
Cannot update oreans.sys driver (admin rights) = 不能更新oreans.sys驱动（管理员权限）
Cannot open oreans.vxd driver (already in use) = 不能打开oreans.vxd驱动（已经在使用中）
Driver cannot be updated = 驱动不能被更新
Computer needs to be reset to install driver = 需要重新启动机器或者安装驱动
Cannot write oreans.vxd (already in use) = 不能写oreans.vxd驱动（已经在使用中）

Trial nag screen (reminder) = 试用版界面（提醒）
Trial days expired = 试用版－已到使用天数！
Trial executions expired = 试用版－已到使用次数！
Trial date expired = 试用版－已到使用日期！
Trial runtime expired = 试用版－已到使用时间！
Trial global time expired = 试用版－已到累计允许使用分钟！
Trial locked to different country = 试用版-不允许本系统语言使用当前程序！
Trial extension key corrupted = 试用版序列号错误。
No more trial extensions allowed = 不能在延长试用版。
Show registration info (only first time when registered) = 显示注册信息（只是时第一次显示）
License days expired = 授权许可－已到使用天数！
License executions expired = 授权许可－已到使用次数！
License date expired = 授权许可－已到使用日期！
License global time expired = 授权许可－已到累计允许使用分钟！
License key corrupted = 授权许可错误。
License locked to different machine = 授权许可与本机不匹配。
License without machine locking = 序列号没有机器锁
No more hardware changes allowed = 已达到最大的硬件更换限制。
Stolen license key = 伪造的授权许可。
License is not expirable = 授权许可没有过期。
License required to run = 本程序需要授权许可才能运行。
Trial/Licensing Manager manipulated = 授权许可无效。
Invalid user/password (for password dialog) = 无效的用户名/密码（对于密码框）

This application(s) will run in trial/restricted mode, until registered. = 应用程序运行在试用/限制模式，一直到注册
Days Expiration = 使用天数
Date Expiration = 使用日期
Executions = 使用次数
Run Time (execution) =使用时间 
Global Time = 累计允许使用分钟
days = 天数
times = 次数
minutes = 分钟
Unlimited = 无限制
(For custom restrictions) = （对客户限制）
Trial Restrictions = 试用版限制
Clock Change = 改变时间后
Trial Extension = 试用版延长
Lock trial to user language = 限制试用版用户系统语言
Allow trial period to be extended (with a valid key) =允许延长试用版本的使用时间（使用有效的序列号） 
Extension Key distribution options = 延长序列号时间选项
With single file = 使用单个文件
With Registry = 使用注册
Value Name = 值名称
Maximum Extensions = 最长的延长期
Maximum extensions allowed = 允许最长的延长期

This option sets a trial period to a certain amount of days since the application is started for the first time = 这个选项设定试用版的试用天数，从第一次允许程序来计算
This option sets an exact date for the end of the trial period = 这个选项准确地设定试用版本的过期时间
This option sets an exact number of executions allowed for an application = 这个选项准确地设定允许程序执行的次数
This option sets an exact amount of time (in minutes) that an application can stay in memory = 这个选项准确地设定应用程序允许再内存中运行的时间（分钟）
This option sets an exact amount of total time (in minutes) that an application can run during all Windows® sessions =这个选项准确地设定应用程序累计可以允许运行的时间（分钟）
This option allows an application to run in trial mode without any restrictions added by WinLicense = 这个选项准确地设定试用模式下应用程序可以没有任何的限制运行
You can select how sensitive WinLicense will behave against clock changes. If for example, you select "1 day clock back", WinLicense will ignore if the clock has been turned back for 1 day. = 你可以设定WinLicense 的相对于时钟的灵敏度。例如“1天”，WinLicense将会忽视在1天内的时间改变。
This option allows an application to be locked to specific country when it runs in trial mode = 这个选项允许在试用模式下锁定特定的国家
This option allows you to extend the trial period of your application with special trial extension keys = 这个选项允许试用延期的序列号来延长试用版的使用时间
This option sets the name of a trial extension file to be searched by WinLicense when the application is being started = 这个选项设定在应用程序运行时WinLicense 设定试用延长文件的名称
This option is used to allow distribution of extension keys as Windows® Registry key files = 这个选项允许使用Windows® 的注册表来分发序列号
This option limits the amount of trial extensions that an application can be extended = 这个选项准确地设定允许延期的次数

Any clock change = 任何时间的改变
1 hour clock back = 1小时回退
1 day clock back = 1天回退

This application(s) can be registered, with the presence of a valid key. = 开启序列号授权
License Keys Accepted = 接受序列号
Types of accepted License Keys = 序列号的类型
Single file = 单个文件
Registry = 注册表
Security Options = 安全选项
Enable SmartActivate® System for user-side generated keys. = 启用对于用户生成的序列号智能激活
Allow only hardware dependent (locked) registrations. = 允许只是硬件（锁）的依赖注册
Accept only temporary keys (that expire). = 只接受临时的序列号（过期情况下）
Application only runs when registered. (Requires a key to run) = 应用程序只有在注册后才能运行（需要一个序列号来允许）
Clear trial info when registered. = 当注册时清除使用版本信息
License Key Signature = 序列号签署
Level 1 = 等级1
Level 2 = 等级2
For professional and elegant licensing control, WinLicense offers the SmartActivate® System. This technology allows an application to be registered using SmartActivate® keys = 为了提供专业的序列号控制，WinLicense提供了智能激活®系统，这项技术允许使用智能激活®系统来注册序列号
This option restricts the use of registration keys to a specific computer. As each computer has an unique machine ID (processor type, hard disk and BIOS serial), WinLicense can lock a registration key to that specific machine = 这个选项限制序列号只能在某一个特定的机器（处理器类型，硬盘，启动码）上来运行，WinLicense 可以锁定序列号到特定的机器。
This option denies the use of "time unlimited" registration keys and forces WinLicense to accept only temporary registration keys = 这个选项拒绝使用“没有时间限制”的序列号，而且强制WinLicense 来接受临时的序列号
This option allows user to run an application only in the presence of a valid registration key. WinLicense will terminate the application if no key is found or if it is invalid = 这个选项强制应用程序运行在合法的序列号情形下，如果时非法的话，WinLicense 将会退出程序
The purpose of this option is to clear the trial information from a computer once an user receives a valid registration key and registers an application. If the user decides to remove the registration key or it expires, the trial period will restart from zero = 这个选项的目的时在注册正式的序列号后清除使用版本的信息，如果用户去除注册信息或者过期的话，试用版将重新启动并且从0开始计算
This option allows you to select the signature level used by WinLicense to check that licenses for your applications are genuine = 这个选项允许你来选择一个签署的等级，WinLicense 使用它来检查你的应用程序。

Enable Password Protection = 启用密码保护
Password requirement = 需要密码
Password Action = 密码操作
Encrypt EXE using the password hash. = 使用密码的哈希数值来加密可执行程序
On Normal / Trial Version = 在普通版 / 试用版
On Registered Version = 已注册版
Never ask for a password. = 从不询问密码
I will ask for a password manually. = 将手工地请求密码
Automatically, ask for a password only the first time. = 自动的，在第一次询问密码
Automatically, always ask for a password. = 自动的，一直询问密码

Hardware Lock = 硬件锁
Custom Hardware Items =客户硬件条目 
Hardware Items = 硬件条目
All hardware items = 所有硬件条目
CPU = CPU
BIOS =  BIOS
MAC Address = MAC网卡的地址
HDD Serial = HDD硬盘的序列号
Allowed CPU changes = 允许替换CPU
Allowed BIOS changes = 允许替换BIOS
Allowed NIC changes = 允许替换NIC
Splash settings = 启动画面设置

Keep Trial Running = 保持试用版运行
Keep running = 保持一直运行
Launch Application when Trial Expired = 当试用版过期时运行应用程序
Launch Application = 运行应用程序
Application Name: = 应用程序名称
Enable Custom Event = 启用客户事件
Export Specific Generators = 导出特定的生成器
Event Name: = 事件名称：
Export Generators = 导出生成器
Custom Event = 客户事件
This option will export a specific license generator when your application is being protected = 这个选项将在应用程序保护时导出一个特定的序列号生成器
This option will run an external application when the trial period in your application has expired. = 这个选项设定在你的试用版应用程序过期时运行一个额外的程序。
You can define a custom event to exclude the initialization of several protected applications at the same time. This option is also suitable when your application is launched many times per minute. =  你可以自定义事件来拒绝在同一时间初始化保护应用程序。这个选项同样适合在你的应用程序在分钟的时间内被多次运行
Check this option if you want that your application continues running in trial mode if an invalid license key is present. =当你想在你的应用程序在试用模式时遇到一个无效的序列号还想继续运行，请检查这个选项  
*** Demo Version *** = ***试用版***
Destroy Exports section = 销毁导出段
This option will destroy the export table of your DLL control for maximum security = 为了最好的安全这个选项将会销毁你的动态连接库导出的表
Select specific functions from your DLL to handle each event = 在你的动态连接库中为每个事件选择一个处理者
DLL Control file = 动态连接库控制文件

Export specific generators to App. folder = 导出特定的生成器到文件夹
Trial in debug mode (for testing purposes) = 试用版在调试模方式（为了测试）
Check this option if you want to create a custom license generator for your protected application. The generator will be created in a subfolder inside your application folder. = 如果你想定制话序列号生成器来保护你的程序，请检查这个选项。 生成器将会在的应用程序目录创建一个子文件夹
Uncheck this option only when you are going to release your protected program. For testing purposes, leave this option checked to avoid storing unnecessary information in your system about your trial status. = 仅当你想发布的的保护程序时才不勾选这一项，勾选这一项来避免在试用状态时存储不必要的信息到你的机器上去

&Add = 添加
&Edit = 修改
&Delete = 删除
Name = 名称
Company = 公司
Total Customers: = 总共的客户
New Customer = 新建客户
Edit Customer = 编辑客户
Delete Customer = 删除客户
Customers = 客户
Extra Details = 附加信息
Add Customer = 添加客户
Update = 更新
Filename = 文件名
Version = 版本
Total Software: = 总共的软件：
Do you want to delete this software? = 你想删除这个软件吗？
Confirm = 确认
Add Software =增加软件 
Edit Software = 编辑软件
Delete Software = 删除软件
Duplicate Software = 相同的软件
(leave blank to use the same input and output filename) = 空的话表示使用相同的输入输出名
Input File Type = 输入文件类型
License Unique Key = 序列号唯一的标志符
Trial Unique Key =  使用版本的序列号
Password Unique Key =  密码的唯一标志符
Windows Standard Executable (EXE) = Windows 标准应用程序
Dynamic Link Library (DLL) = 动态链接库（DLL)
OLE Control Extension (OCX) = OLE控件扩展文件（OCX)
Windows .NET Executable = Windows .NET应用程序
Windows NT/XP Service = Windows NT/XP服务
Screensaver File (SCR) = 屏幕文件(SCR)
Copy Software = 拷贝软件
Reg Unique Key missing. Please, select one. = 缺少注册表序列号，请选择一个
Software Manager = 软件管理器
Sofware name missing. Please, select one. = 缺少软件，请选择一个 
Reg Unique Key is too short. Please, select a new unique key. = 注册表序列号太短，请选择一个
Trial Unique Key missing. Please, select one. = 缺少试用版序列号，请选择一个
Trial Unique Key is too short. Please, select a new unique key. = 缺少试用版序列号太短，请选择一个
Pass Unique Key missing. Please, select one. = 缺少序列号，请选择一个
Pass Unique Key is too short. Please, select a new unique key. = 序列号太短，请选择不同的一个
The software already exists in database. Please, choose a new software name or version. = 这个软件已经在数据库中存在了，请重新选择一个或者选择新的版本。
A new License Hash is going to be created. Previous generated licenses will not work if you create a new hash. Proceed? = 新的序列号哈希数值将被生成，之前的就的序列号将实效，继续吗？
Duplicated Software = 相同的软件
File cannot be opened. Make sure the application is not running or being used. = 找不到文件，请确认程序没有在运行或使用
Protection Error = 保护出错
Protect Error = 保护出错
File is compressed or already protected. = 文件被压缩或者已经被保护
File has a missing macro START or END. Please correct this error before protecting. = 文件中缺少START 或者END宏，请在保护前修复这个错误
File cannot be opened. Make sure that other application is not using it. = 文件打不开，请确认程序没有在运行或使用
File has an invalid PE header. Unable to protect. = 文件的PE头无效，不能保护
File contains one macro with few lines of code on it. Please review your macros before protecting. = 文件中存在一个宏包括了太少的代码，请在做保护前检查你的宏
File seems to be in use. Please, close the file to proceed with protection. = 文件可能在使用，请确认程序没有在运行或使用
The splash file does not exist. = 启动画面的文件不存在
Splash = 启动
The splash file seems do not have 256 colors. Only 256 BMP files will be displayed correctly. = 启动画面的文件不是256色，只有256色的图片文件才能正确的显示
The splash file seems to be a BMP compressed. Only non compressed BMP files will be displayed correctly. = 启动画面的文件好像被压缩了，只有没有压缩图片文件才能正确的显示
Do you want to cancel the protection process? = 你想停止退出保护的进程吗？
Cannot open file to protect for writing. Please, make sure that the file is not being used or running. Protection aborted. = 文件打不开不能写文件，请确认程序没有在运行或使用
Cannot write protected file to disk. Please, make sure you have write permits and enough space in your disc. = 不能写保护的文件到硬盘中去，请确认你有写的权限和硬盘里有足够的空间
Sorry, the DEMO version of WinLicense only allows protection with trial/licensing in debug mode = 对不起，演示版本只能在调试的模式下来做保护
WinLicense DEMO = WinLicense演示版

&Add License = 添加序列号
&Edit License = 编辑序列号
&Delete License = 删除序列号
Create License Key = 生成序列号
Mark as Stolen = 标记为盗用号
Unmark Stolen = 清除盗用号标志
Stolen = 盗用
Ban Hardware IDs = 硬件标识码
Please make a selection... = 请选择一项
License Details = 序列号详细信息
License Generation = 序列号生成器
Hardware ID = 硬件标识码
Custom Data = 客户数据
Key Type = 键类型
Country Locking = 系统语言锁
Store generated Licenses in folder: = 存储生成好的序列号到文件夹
Generate File Key = 生存文件序列号
Generate Registry Key = 生成注册表序列号
Generate Text Key = 生成文本序列号
Generate SmartActivate Key = 生成智能序列号

Total Software: = 全部软件
All = 全部
Please make a selection... = 请选择一项
Nothing selected. = 没有一项被选中
Selection: = 选项
Software: = 软件
Do you want to mark the current key as stolen? = 你想标记当前的序列号为盗用号吗？
Stolen Keys = 盗用号
Do you want to unmark the current key from being stolen? = 你想清除之前标记为盗用号的序列号吗？
Do you want to delete this license? = 你想删除这个序列号么
Warning: The generated keys will have the settings from the current project. Proceed? = 警告：生成的序列号将要应用到当前的项目中，确认？
Generate License = 生成序列号
Cannot create directory: = 不能生成字典
Please, select which type of license you want to generate = 请选择你想生成哪种类型的序列号
Keys successfully generated in folder: = 序列号成功的生成在文件夹下
Please, first select a valid application to protect = 请首先选择有效的应用程序来保护
Ban Hardware Id = 硬件标志符

License Restrictions = 受限制的序列号
Customer = 客户
Software = 软件
Save = 保存
Edit License = 编辑序列号
Add License = 添加序列号
Please, select a customer from database. = 请从数据库中选择客户
License Manager = 序列号管理
Please, select a software from database. = 请从数据库中选择软件
Please, insert a Hardware ID for verification = 请输入硬件标志符来验证
The inserted Hardware ID is valid = 输入的硬件标志符是有效的
Invalid Hardware ID inserted = 无效的硬件标志符
Another instance of WinLicense is running = 有另外一个WinLicense程序在运行
You have enabled SmartActivate keys but you have not selected any type of License Keys accepted (Single file or Registry) Remember that you have to use WLRegSmartKeyInstallToFile or WLRegSmartKeyInstallToRegistry to finally install the SmartActivate key = 你应该启用SmartActivate 序列号，但是你没有选中任何一现你接受的序列号（单个文件或者注册表），请记住你应该使用WLRegSmartKeyInstallToFile 或者WLRegSmartKeyInstallToRegistry 来
File has not being simulated: = 文件没有被模拟
Please simulate the file before protection or uncheck the "Force simulation before protecting" checkbox = 请在保护或者取消选项“在保护前强制模拟”选项前模拟一个文件
Warning: Your application has been set up to be registered with a valid license key, but you have not selected any way of registration. If you continue, your application will not be able to be registered. Proceed? = 警告：你的应用程序已经注册一个无效的序列号，但是你不应该去选择一个新的序列号，如果你继续操作的话你的应用程序将不能再被注册，继续？
Warning: Your application has been set up to be extended with trial extension key, but you have not selected any way to extend the trial period. If you continue, your application will not be able to be extended. Proceed? = 警告：你的应用程序已经注册一个使用版本的序列号，但是你不应该使用任何方式去延长试用期，如果你继续操作的话你的应用程序将不能再被延长试用，继续？
Your application header is incompatible with WinLicense. Do you want WinLicense to rebuild your application header? = 你的应用程序开头与WinLicense不兼容，你希望用WinLicense重新创建你的应用程序开头吗？
Sorry, WinLicense Standard cannot protect .NET files. You need to upgrade to WinLicense Professional for .NET support. Upgrade now? = 对不起，WinLicense 标准版不能保护.NET文件，你想更新到WinLicense 专业版来支持.NET文件吗？现在更新？
Note: CodeReplace has been added into your application = 注解：代码替换功能已经加入到你的应用程序中
(Application header has been rebuilt by WinLicense) = （应用程序开头部分已经被WinLicense重新编译）
Error: The selected file is not an x64 application. You need WinLicense x32 to protect that application. = 错误：选择的文件不是一个64位应用程序。你需要用WinLicense x32来保护你的应用程序。
Error: The selected file is an x64 application. You need WinLicense x64 Edition to protect that application. = 错误：选择的文件是一个64位应用程序。你需要用WinLicense 64位来保护你的应用程序。
Sorry, the MAP file was not found: = 对不起，没有找到映射文件：
Please, generate a MAP file for your application = 请为你的应用程序生成映射文件
Sorry, the current version of WinLicense does not support CodeReplace in Visual Basic Pcode applicaitons = 对不起，当前的WinLicense不支持在Visual Basic应用程序中使用代码替换功能
Sorry, the current version of WinLicense does not support CodeReplace in .NET applications = 对不起，当前的WinLicense不支持在.NET应用程序中使用代码替换功能
There are some functions highly executed and some not executed in simulation. Do you want to unselect those functions? = 在模拟器中有部分功能高级地执行了，有部分功能没有执行，你想不选择这些功能吗？
There are some functions highly executed in simulation. Do you want to unselect those functions? = 在模拟器中有部分功能高级地执行了，你想不选择这些功能吗？
There are some functions not executed in simulation. Do you want to unselect those functions? = 在模拟器中有部分功能没有被执行，你想不选择这些功能吗？
Messages exported to: = 消息 导出到
Messages imported from: = 消息 导入到
WinLicense GUI Overview = WinLicense 界面总体概括
Trial Settings = 试用设置
Trial SDK = 试验SDK
Registration SDK = 注册SDK
Password Protection = 密码保护
Miscellaneous SDK = 混淆SDK
Hardware Lock = 硬件锁
WARNING: Protected in Trial Debug Mode = 警告：在试用的调试版本下保护
Click and select here = 点击以及选中这里
ERROR: None of the functions handlers where specified in DLL Control = 错误：在动态连接库中没有说明函数句柄
Sorry, WinLicense DEMO does not support RISC-128 processors = 对不起，WinLicense 试用版本不支持RISC-128处理器
Sorry, WinLicense DEMO does not support Dynamic Opcodes = 对不起，WinLicense 试用版本不支持动态的操作码
Signature Level 2 is not accepted for the current Software. Please, go to the Sofware Panel and re-create a new License Hash for your software = 当前的软件等级2签署没有被接受。请到软件的控制面板中重新为你的软件创建新的序列号的哈希数值
.NET Module = .NET模块
File has a missing macro START or END. Please review your macros again: = 文件中缺少START 或者END宏，请重新检查你的宏：
File cannot be opened. Make sure that other application is not using it: = 文件不能被打开，请确认没有其他应用程序在使用它
File has an invalid PE header. Unable to inspect file: = 文件包含了无效的PE头，无法检查这个文件：
File contains one macro with few lines of code on it. Please review your macros again: = 文件中存在一个宏中包括了一些代码，请重新检查你的宏
Deep file analysis in progress = 在进行深度的文件分析
File analysis in progress = 在进行文件分析
Please wait... = 请稍候
Analyzing CodeReplace macros = 分析代码替换宏
Are you sure you want to remove the selected Hardware ID? = 你确定你想去除选中的硬件标志符
List of Banned  Hardware IDs: = 列出被禁止的硬件标志符
Add = 添加
Remove = 删除
Done = 完成
Generating License Hash = 生成序列号的哈希数值
Generate Password = 生成密码
Password Generation = 密码生成
Store generated Passwords in folder: =在文件夹中存储生成的密码 
Total Passwords: = 总共的密码：
Do you want to delete the selected record? = 你想删除选中的记录吗
Password file generated in folder: = 密码已经在文件夹中生成了
Password Generator = 密码生成器
Password Manager = 密码管理
Details = 详细信息

Add Password = 添加密码
Edit Password = 编辑密码
Please, select a customer to generate the password = 请选择一个客户来生成密码
Please, select a software to generate the password = 请选择一个软件来生成密码
Rolling back your actions = 回退你的操作

Generate Extension = 延长生成
Level = 等级
Trial Extension Generation = 试用延长生成器
Store generated Extensions in folder: = 存储生成号的延长到文件夹中
Generate File Key = 生成文件序列号
Generate Registry Key = 生成注册表序列号
Trial extension key/s generated in folder: = 试用版的延长序列号生成在文件夹中
Trial Extension Generator = 试用版的延长生成器
Edit = 编辑
Add Trial Extension = 添加试用延长
Edit Trial Extension = 编辑试用延长
Please, select a software to generate the trial extension = 请选择一个软件来生成延长试用

Warning: Trial in Debug Mode = 警告：试用在调试模式
Debug Mode Trial = 调试模式试用
The application that you are going to protect will not include the SecureEngine Trial Storing Manager*. = 你将要保护的软件不包括试用的安全引擎管理。 
The trial information will be stored under the registry key: = 没有在注册表下保存试用的信息：
(You can access to that key to reset/test the WinLicense Trial Engine) = 你可以访问那个序列号来重置或者测试WinLicense 试用引擎
*To enable the SecureEngine Trial Storing Manager, uncheck the option "Trial in debug mode" in the Protect screen. = 请在保护的页面上构选“在调试版本下试用”来开启安全引擎管理功能
Don't show this screen again = 下次不在显示这个画面

Do you want to delete the selected client? = 你想删除当前选择的客户端么？
Enter new Hardware ID to ban: = 请输入新的被禁止的硬件标志码：
The entered Hardware ID does not seem to be valid (must be at least 32 chars) Please, enter a valid Hardware ID = 输入的硬件标识码不合法(必须至少32个字符）请输入一个有效的标志符

File has a missing macro START or END. Please correct this error before protecting: = 文件中缺少START 或者END宏，请在做保护前修复好错误：
File has an invalid PE header. Unable to protect: = 文件包含了无效的PE头，无法被保护：
File contains one macro with few lines of code on it. Please review your macros before protecting: = 文件中存在一个宏中包括了一些代码，请在做保护前重新检查你的宏
The input file seems to be in use. Please, close the file to proceed with protection: = 输入的文件好象在使用中，请关闭文件来处理保护

Code Virtualization = 代码虚拟化
Virtual Opcodes Obfuscation = 虚拟的操作码混淆
Current: = 当前的：
Virtual Machine Complexity = 虚拟机器复杂化
Size (Approx): = 大小（估计数值）
Opcodes Mutation = 操作码转换
Multiple Virtual Machines = 多字节的虚拟机
NumVMs * SizeVM: = 虚拟机个数×虚拟机大小
Fake Stack Emulation =欺骗堆栈模拟 
Strip Relocations (EXEs) = 去除重新定位（可执行文件)
Strip relocations = 去除重新定位
Re-Virtualization = 重新虚拟化
Multi Branch Technology = 多分支技术
Fake Emulation = 欺骗模拟器
Keep original name = 保持原始名称
Functions that will be virtualized: =功能将要被虚拟化 

You can customize how complex will be the Virtual Machine opcodes. The size of the generated opcodes depend on the complexity selected = 你可以定制虚拟机操作的复杂程度，生成好的操作码大小与设定的复杂程度相关
You can customize how complex the generated virtual machine will be. The size of the virtual machine depends on the complexity that you select = 你可以定制虚拟机操作的复杂程度，生成好的操作码大小与设定的复杂程度相关
You can mutate the internal virtual opcodes, generating a more complex virtual machine = 你可以变换内部的虚拟操作码，生成更复杂的虚拟机
The generad Virtual Machine and virtual opcodes will be placed inside the last section of your application. You can rename the last section of your application as desired = 生成好的虚拟机和虚拟操作码被放在最后你的应用程序的最后一端，你可以重新设置你的你想要的最后一段的名称
You can create several Virtual Machines inside your protected application. Each Virtual Machine will process specific blocks of code in your application = 你可以在你的应用程序中创建一些虚拟机，没一个虚拟机来处理你所设定的每一块
This option will assume the stack to be initilized to zero for all not allocated entries in stack. This option should be enabled for PureBasic applications = 这个选项将假定你所有堆栈上的实体被初始化为0，这个选项在PureBasic 应用程序中应该被开启
You can remove the relocations section from the PE header for EXE files, reducing the size of the final protected application = 你可以在PE的头块上去除重新定位的段，来减少你最终保护程序的大小
Re-Virtualization is an extremely powerful technique against Reverse Engineering. But it can decrease a lot the performance in speed in the protected blocks.  Please, check the performance of your application when protected with Re-Virtualization =重新虚拟化对于保护逆向工程是一个非常有用的技术。 但是它会在保护的块上降低它的性能。请对于使用了重新虚拟化的块进行重新性能测试。
This option will insert multiple conditional branch instructions inside your unique virtual machine, making it harder to analyse = 这个选项将在的的唯一的虚拟机中插入多字节的多条件指令。使它很难分析。

Please, select an application to protect = 请选择需要保护的程序
The selected application does not have any functions to virtualize. Please insert functions using the SDK =你所选择的程序没有任何功能来被虚拟化，请使用SDK来添加功能。 
All functions to virtualize were disabled. Please, select at least one = 所有虚拟化的功能都被禁止了，请至少选择一项
Warning! A macro with no code inside has been found. This might be due to compiler optimizations. Please, disable your compiler optimizations or review each macro. = 警告！发现一个没有代码的宏。这可能是由于编译器优化的原因。请关闭编译器优化器或者重新检查所有的宏。
Virtual Functions = 虚拟的功能
Inserted via "Call VarPtr": = 通过“调用VarPtr”来插入
Inserted via inline Assembly: = 通过“内联汇编”来插入
Inserted via auxiliar API: = 通过“帮助API”来插入
Inserted via MAP file: = 通过“映射文件”来插入
NO FUNCTIONS FOUND TO VIRTUALIZE!!! = 没有发现可以虚拟化的功能
(Application header has been rebuilt by Code Virtualizer) = 程序头部被虚拟化器重新编译了
Protecting an Application = 保护一个应用程序
Learn About Virtualizer = 学习虚拟化器
Code Virtualization = 代码虚拟化
Code Virtualize Macros = 代码虚拟化宏
**** Sorry, the DEMO version does not support protection via command line **** = ****对不起使用版本不支持命令行方式保护****
*** ERROR: File to protect cannot be acccessed. (Exit code 2) *** = ***错误：不能访问被保护的文件（退出码2)***
*** ERROR: File does not have any blocks to protect. (Exit code 3) ***  ***错误：文件没有可以保护的块（退出码3）***
*** ERROR: File to protect cannot be opened. (Exit code 5) *** = ***错误：不能打开被保护的文件（退出码5）***
Generating Specific Virtual Machine = 生成特定的虚拟机
Virtualizing Function = 虚拟化的方法
Re-Virtualizing ... = 重新虚拟化...
Flushing file ... = 整平文件...
Sorry, the DEMO version only allows one Virtual Machine per application = 对不起，试用版只允许一个程序使用一个虚拟机
Sorry, the DEMO version does not support Re-Virtualization = 对不起，试用版不支持重新虚拟化
The application is already protected. You cannot protect an already protected application in the DEMO version = 这个应用程序已经被保护了，这使用版本中不能保护一个已经被保护的文件
The Input application cannot be accessed. Please, check that the application is not in use: = 不能访问输入的文件，请检查这个文件是不是在使用中：
The Output application cannot be accessed. Please, check that the application path is valid or file is not in use: = 不能访问输出的文件，请检查这个文件是不是在使用中或者应用程序路径是否有效：
Limitations in DEMO version: = 使用版本中的限制：
Virtual Opcodes Obfuscation set to NORMAL = 虚拟操作码混淆设置为普通等级
Virtual Machine Complexity set to NORMAL = 虚拟机复杂度设置为普通等级
Only ONE macro is virtualized = 只有一个宏被虚拟化
The Output application cannot be accessed. Please, check that the application is not in use: = 不能访问输出的文件，请检查这个文件是不是在使用中：
PE Information = PE（应用程序）信息
Input PE file: = 输入PE（应用程序）文件
Output PE file: = 输出PE（应用程序）文件
Virtual Functions found: = 发现虚拟的方法
PE file analysis... OK! = PE（应用程序）分析...成功！
Virtualization = 虚拟化
Generating Specific Virtual Machine = 生成特定的虚拟机
Size: = 大小：
Virtualizing Function = 虚拟化的方法
Start: = 开始：
Skipped = 跳过
bytes = 字节
Cancelling... = 取消
Re-Virtualization = 重新虚拟化
Re-Virtualizing ... = 重新虚拟化
Final Stats = 最终状态
Virtualized Functions: = 虚拟化方法：
Skipped Functions: = 跳过方法：
Errors: = 错误：
Increase in size: = 增加的大小：
Application successfully protected! = ：保护程序成功
Protection CANCELLED! = 取消了保护
Do you really want to Cancel the protection process? = 你真的的取消保护进程吗？
Cancel Protection = 取消保护
Select a Software to protect from the WinLicense database = 从WinLicense 数据库中选择所要保护的软件


Anti-Debugger Detection = 
Advanced = 
Disable = 
Level 1 = 
Level 2 = 
File Patch (sign support) = 
Detect any change = 
Allow 1 hour back = 
Allow 1 day back = 
Allow clock changes = 
External Hardware = 
U3 USB device = 
(not Windows 9x/Me compatible) = 
Periodically check U3 device = 
The U3 USB device will be monitored to check if it's unplugged. The function WLHardwareRuntimeCheckU3 checks if the device is present or not at any time. = 
Checking U3 USB device = 请检查 U3 USB 驱动
Network Instances: No more Allowed = 
Network Instances: Server not running = 
** Not available in current version ** = 
License installation time-limit exceeded = 
License disabled in current instance = 
Control Messages from external DLL = 
Select a DLL that will handle the displaying of each message. If no DLL is selected, Themida will display the above messages in a MessageBox =  
Functions Handlers = 
Select the function in your DLL that will handle the protection messages = 
Select the DLL that will handle all WinLicense events = 
Hide from PE scanners = 
Type 1 = 
Type 2 = 
Localization = 
Add Manifest = 
Don't add manifest = 
Add Custom manifest = 
MSVC80 manifest = 
XP Themes = 
MSVC90 manifest = 
Launch Application = 
This option will run an external application when the trial period in your application has expired. = 
Delete extracted on exit = 
Open Project = 打开工程
Description = 描述
Saved Projects = 保存工程
Date Created = 创建日期
Delete = 删除
Open = 打开
Reset Trial = 试用设置复位
Reset Trial in current machine = 
Search = 搜索
Search Next = 搜索下一个 
Install Before Date = 
Network Instances = 
Instances = 
Store Creation Date = 
Embed user info in key =  
(only for Dynamic SmartKeys) = 
Generate Dynamic SmartKey = 
Default License generation folder = 
License Restrictions = 
Miscellaneous = 
Search Details = 
Search by: = 
Search for: = 
Customer Name = 
GetPrivateProfile APIs support = 
